[
  "# Awards & Recognition - **Spot Awards** at Samsung: - Q4 2023 - Aug–Sep 2024 - **Incredibles Award** (Samsung, 2025) - Employee of the Quarter - Recognition for collaboration with HQ Korea and cross-team initiatives.",
  "# Personal & Open-Source Projects ## OneClick CP (VS Code Extension) - Competitive programming starter kit. - Resets main.cpp, input.txt, output.txt with one click. - Custom snippet support (C++ basics, data structures, algorithms). - Sidebar UI with accordion-style snippet browser. - Planned features: custom snippet creation, logging, template selection. ## BuildMyFolio (Portfolio Website) - React/Next.js project to showcase projects & work experience. - Planned AI Playground integration to demonstrate AI assistants. ## AI Playground (In Progress) - Backend hub for AI prototypes. - Step 1: Retriever for personal knowledge base (this project). - Future: Embeddings, RAG chatbot, evaluators.",
  "# Bharath Kotipalli ## Summary Software Engineer with strong focus on AI, competitive programming, and systems design. Passionate about building tools and assistants that combine low-level algorithmic knowledge with high-level AI systems.",
  "## Experience - **Samsung R&D** (Software Engineer) - Developed automation tool (Python + BeautifulSoup + Perforce) to trace crash points. - Built a generic shared memory communication system between user and kernel space (design patterns: Singleton, Observer). - Collaborated with HQ in Korea on cross-team initiatives. - Helped colleagues with Linux PC setup, ITS debugging, and configurations. - Suggested and implemented usage of virtual memory instead of physical RAM for local builds → saved costs. - **Awards:** Spot Awards (Q4 2023, Aug–Sep 2024). - **Recognition:** Incredibles Award (Employee of the Quarter, 2025). ## Projects - **OneClick CP** (VS Code Extension) - A one-click DSA & CP starter kit. - Features: reset templates, custom snippets, sidebar UI, export solutions. - Open-source on GitHub. ## Skills - **Languages:** C++, Python, JavaScript - **Areas:** AI, Competitive Programming, System Design, Full-Stack Development - **Tools:** PyTorch, React/Next.js, VS Code Extension API, FastAPI",
  "# Education - Strong background in competitive programming and algorithms. - Cleared **SWC Advanced** and **SWC Professional** tests (showcasing proficiency in data structures and algorithms). - Self-taught in AI/ML, currently pursuing mastery by building projects from scratch."
]